Extensions/БИТ_Доработки_НДЭ/DataProcessors/РаботаСФайлами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаботаСФайлами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ДанныеПоКоробам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоКоробам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомерКороба</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БаркодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШККороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ШтрихкодыМонопаллетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыМонопаллетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БаркодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерМонопаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодПаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьМонопаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихкодМонопаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураДляМонопаллета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/ТипыУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыУпаковок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МонотоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/ТипыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Code128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>SSCC</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/DataProcessors/РаботаСФайлами/Forms/ПрисоединенныеФайлы/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Расширение для обработки "РаботаСФайлами.Форма.Файлы"
// 
// Назначение: Выгрузка данных из Excel-файлов в регистр сведений "ДанныеПоКоробам"
// 
// Функционал:
// 1. Добавляет кнопку "Выгрузить данные по коробам" (кнопка создается визуально в расширении)
// 2. Управляет видимостью кнопки (только для Заказа покупателя)
// 3. Управляет доступностью кнопки (только для Excel-файлов, не групп, не зашифрованных)
// 4. Читает Excel-файл и выгружает данные в регистр сведений
// 
// Автор: БИТ
// Дата: 01.06.2026
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура ДополнитьПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Управляем видимостью кнопки в зависимости от типа владельца
	УправлятьВидимостьюКнопки();
	
КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура ДополнитьПриОткрытии(Отказ)
	
	// При открытии формы обновляем доступность кнопки
	ОбновитьДоступностьКнопки();
	
КонецПроцедуры

&НаКлиенте
&После("СписокПриАктивизацииСтроки")
Процедура ДополнитьСписокПриАктивизацииСтроки(Элемент)
	
	// При активации строки в списке обновляем доступность кнопки
	ОбновитьДоступностьКнопки();
	
КонецПроцедуры

&НаКлиенте
&После("СписокПриИзменении")
Процедура ДополнитьСписокПриИзменении(Элемент)
	
	// При изменении выделения обновляем доступность кнопки
	ОбновитьДоступностьКнопки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьДанныеПоКоробам(Команда)
	
	// ====================================================================
	// Обработчик кнопки "Выгрузить данные по коробам"
	// Выполняется на клиенте, проверяет условия и вызывает серверную процедуру
	// ====================================================================
	
	// 1. Проверяем, что владелец - Заказ покупателя
	Владелец = Параметры.ВладелецФайла;
	Если ТипЗнч(Владелец) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Данная функция доступна только для заказов покупателя.'"));
		Возврат;
	КонецЕсли;
	
	// 2. Получаем текущий выбранный файл
	ТекущиеДанные = ПолучитьТекущиеДанные();
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран файл для выгрузки данных.'"));
		Возврат;
	КонецЕсли;
	
	// 3. Проверяем, что это не группа
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выгрузка данных недоступна для групп файлов.'"));
		Возврат;
	КонецЕсли;
	
	// 4. Проверяем, что это файл Excel
	Расширение = НРег(ТекущиеДанные.Расширение);
	Если Расширение <> "xls" И Расширение <> "xlsx" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выбранный файл не является файлом Excel. Выберите файл с расширением .xls или .xlsx'"));
		Возврат;
	КонецЕсли;
	
	// 5. Проверяем, что файл не зашифрован
	Если ТекущиеДанные.Зашифрован Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно обработать зашифрованный файл.'"));
		Возврат;
	КонецЕсли;
	
	// 6. Запрашиваем подтверждение у пользователя
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгрузить данные из файла %1 в регистр сведений ДанныеПоКоробам?'"),ТекущиеДанные.Наименование);
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьДанныеПоКоробамЗавершение", ЭтотОбъект, ТекущиеДанные.Ссылка);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеПоМОНОПаллетам(Команда)
	// ====================================================================
	// Обработчик кнопки "Выгрузить данные по МоноПаллетам"
	// Выполняется на клиенте, проверяет условия и вызывает серверную процедуру
	// ====================================================================
	
	// 1. Проверяем, что владелец - Заказ покупателя
	Владелец = Параметры.ВладелецФайла;
	Если ТипЗнч(Владелец) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Данная функция доступна только для заказов покупателя.'"));
		Возврат;
	КонецЕсли;
	
	// 2. Получаем текущий выбранный файл
	ТекущиеДанные = ПолучитьТекущиеДанные();
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран файл для выгрузки данных.'"));
		Возврат;
	КонецЕсли;
	
	// 3. Проверяем, что это не группа
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выгрузка данных недоступна для групп файлов.'"));
		Возврат;
	КонецЕсли;
	
	// 4. Проверяем, что это файл Excel
	Расширение = НРег(ТекущиеДанные.Расширение);
	Если Расширение <> "xls" И Расширение <> "xlsx" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выбранный файл не является файлом Excel. Выберите файл с расширением .xls или .xlsx'"));
		Возврат;
	КонецЕсли;
	
	// 5. Проверяем, что файл не зашифрован
	Если ТекущиеДанные.Зашифрован Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно обработать зашифрованный файл.'"));
		Возврат;
	КонецЕсли;
	
	// 6. Запрашиваем подтверждение у пользователя
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгрузить данные из файла %1 в регистр сведений ШтрихкодыМонопаллетов?'"),ТекущиеДанные.Наименование);
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьДанныеПоПаллетамЗавершение", ЭтотОбъект, ТекущиеДанные.Ссылка);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеПоКоробамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Обработка ответа пользователя на подтверждение
	Если Результат = КодВозвратаДиалога.Да Тогда
		СсылкаНаФайл = ДополнительныеПараметры;
		ВыгрузитьДанныеПоКоробамНаСервере(СсылкаНаФайл);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеПоПаллетамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Обработка ответа пользователя на подтверждение
	Если Результат = КодВозвратаДиалога.Да Тогда
		СсылкаНаФайл = ДополнительныеПараметры;
		ВыгрузитьДанныеПоПаллетамНаСервере(СсылкаНаФайл);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедуры

&НаСервере
Процедура УправлятьВидимостьюКнопки()
	
	// ====================================================================
	// Управляет видимостью кнопки на форме
	// Кнопка видна ТОЛЬКО для документов "Заказ покупателя"
	// Вызывается при создании формы на сервере
	// ====================================================================
	
	КнопкаВыгрузить = Элементы.Найти("ВыгрузитьДанныеПоКоробам");
	Если КнопкаВыгрузить = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Кнопка видна только если владелец - Заказ покупателя
	Если ТипЗнч(Параметры.ВладелецФайла) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КнопкаВыгрузить.Видимость = Истина;
		КнопкаВыгрузить.Доступность = Истина;
	Иначе
		КнопкаВыгрузить.Видимость = Ложь;
		КнопкаВыгрузить.Доступность = Ложь;
	КонецЕсли;
	
	КнопкаВыгрузитьПаллеты = Элементы.Найти("ВыгрузитьДанныеПоМоноПаллетам");
	Если КнопкаВыгрузитьПаллеты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Кнопка видна только если владелец - Заказ покупателя
	Если ТипЗнч(Параметры.ВладелецФайла) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КнопкаВыгрузитьПаллеты.Видимость = Истина;
		КнопкаВыгрузитьПаллеты.Доступность = Истина;
	Иначе
		КнопкаВыгрузитьПаллеты.Видимость = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеПоКоробамНаСервере(СсылкаНаФайл)
	
	Перем ЗаписьРегистра;
	Перем ТаблицаДанных;
	Перем ИмяФайла;
	Перем ДвоичныеДанныеФайла;
	
	//возвращает таблицу всех найденных дублей(для программиста помощь, сама функция нигде не используется)
	ПроверкаДублей = НайтиВсеДублиШтрихкодовНоменклатуры();
	
	// Включаем привилегированный режим для обхода проблем с доступом
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		// -----------------------------------------------------------------
		// 1. Проверка владельца
		// -----------------------------------------------------------------
		Владелец = Параметры.ВладелецФайла;
		Если ТипЗнч(Владелец) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ВызватьИсключение НСтр("ru = 'Функция доступна только для заказов покупателя.'");
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 2. Получаем двоичные данные файла (из хранилища 1С)
		// -----------------------------------------------------------------
		ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СсылкаНаФайл, Ложь);
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось получить данные файла.'");
		КонецЕсли;
		
		// Проверяем расширение
		ФайлОбъект = СсылкаНаФайл.ПолучитьОбъект();
		Если ФайлОбъект = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Файл не найден.'");
		КонецЕсли;
		
		Расширение = НРег(ФайлОбъект.Расширение);
		Если Расширение <> "xls" И Расширение <> "xlsx" Тогда
			ВызватьИсключение НСтр("ru = 'Неподдерживаемый формат файла. Требуется файл Excel (.xls или .xlsx).'");
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 3. Создаем временный файл на сервере (иначе ТабличныйДокумент не прочитает)
		// -----------------------------------------------------------------
		// Получаем имя временного файла с правильным расширением
		ИмяФайла = ПолучитьИмяВременногоФайла("." + Расширение);
		
		// Сохраняем двоичные данные во временный файл
		ДвоичныеДанныеФайла.Записать(ИмяФайла);
		
		// -----------------------------------------------------------------
		// 4. Читаем Excel через ТабличныйДокумент (без COM!)
		// -----------------------------------------------------------------
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		// Читаем файл. Важно: СпособЧтенияЗначений.Текст - чтобы даты и числа читались как строки
		// Это самый надежный способ, работающий на сервере без Excel
		ТабличныйДокумент.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
		// Определяем количество строк с данными
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
		
		// Создаем таблицу значений для результатов
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("ШККороба", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
		ТаблицаДанных.Колонки.Добавить("БаркодТовара", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(500)));
		
		// Читаем данные, начиная со 2-й строки (пропускаем заголовок)
		Для НомерСтроки = 2 По КоличествоСтрок Цикл
			
			// Получаем значение из первой колонки
			Область1 = ТабличныйДокумент.Область(НомерСтроки, 1);
			ЗначениеКолонки1 = Область1.Текст;
			
			// Получаем значение из второй колонки
			Область2 = ТабличныйДокумент.Область(НомерСтроки, 2);
			ЗначениеКолонки2 = Область2.Текст;
			
			// Пропускаем пустые строки
			Если ПустаяСтрока(ЗначениеКолонки1) Тогда
				Продолжить;
			КонецЕсли;
			
			// Ограничение для производительности
			Если ТаблицаДанных.Количество() >= 10000 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаТаблицы = ТаблицаДанных.Добавить();
			СтрокаТаблицы.ШККороба = СокрЛП(ЗначениеКолонки1);
			СтрокаТаблицы.БаркодТовара = СокрЛП(ЗначениеКолонки2);
			
		КонецЦикла;
		
		// Проверяем, что данные считаны
		Если ТаблицаДанных.Количество() = 0 Тогда
			Сообщить(НСтр("ru = 'В файле не найдено данных для выгрузки (после заголовка нет заполненных строк).'"));
			Возврат;
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 5. Очистка старых данных в регистре
		// -----------------------------------------------------------------
		НаборЗаписей = РегистрыСведений.ДанныеПоКоробам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Владелец);
		НаборЗаписей.Записать(Истина);
		
		// -----------------------------------------------------------------
		// 6. Запись новых данных в регистр сведений
		// -----------------------------------------------------------------
		КоличествоЗаписей = 0;
		ТаблицаДанных.Сортировать("БаркодТовара");
		Если ТаблицаДанных.Количество() > 1 Тогда 
			ПредыдущийБаркодТовара = ТаблицаДанных[0].БаркодТовара;
			//ТекущийБаркодТовара = ТаблицаДанных[0].БаркодТовара;
		КонецЕсли;
		ПорядковыйНомерКороба = 1;
		Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
			               |ИЗ
			               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			               |ГДЕ
			               |	СОКРЛП(ШтрихкодыНоменклатуры.Штрихкод) = &БаркодТовара
			               |	И ШтрихкодыНоменклатуры.Номенклатура.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("БаркодТовара", СокрЛП(СтрокаДанных.БаркодТовара));
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Если  Не Выборка.Следующий() Тогда 
				Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " не найден штрихкод номенклатуры, запись не будет создана!");
				Продолжить;
			Иначе
				Если Выборка.Количество() > 1 Тогда
					Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " найдено более одной записи штрихкодов (" + Выборка.Количество() +") , запись не будет создана!");
					Продолжить;
				КонецЕсли;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура
				               |ИЗ
				               |	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
				               |ГДЕ
				               |	ЗаказПокупателяЗапасы.Ссылка = &ДокументОснование
				               |	И ЗаказПокупателяЗапасы.Номенклатура = &Номенклатура";
				Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
				Запрос.УстановитьПараметр("ДокументОснование", Владелец);
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				Если  Не Выборка.Следующий() Тогда 
					Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " не найдена номенклатура в заказе покупателя, запись не будет создана!");
					Продолжить;
				Иначе
				
					// Вместо набора записей, для каждой строки:
					ЗаписьРегистра = РегистрыСведений.ДанныеПоКоробам.СоздатьМенеджерЗаписи();
					ЗаписьРегистра.Период = ТекущаяДата();
					ЗаписьРегистра.ДокументОснование = Владелец;
					ЗаписьРегистра.ШККороба = СокрЛП(СтрокаДанных.ШККороба);
					
					Если ПредыдущийБаркодТовара = СтрокаДанных.БаркодТовара Тогда
						ЗаписьРегистра.ПорядковыйНомерКороба = ПорядковыйНомерКороба;
					Иначе 
						ПорядковыйНомерКороба = 1;
						ЗаписьРегистра.ПорядковыйНомерКороба = ПорядковыйНомерКороба;
					КонецЕсли;
					ПредыдущийБаркодТовара = СтрокаДанных.БаркодТовара;
					ПорядковыйНомерКороба = ПорядковыйНомерКороба + 1;
					
					ЗаписьРегистра.БаркодТовара = СокрЛП(СтрокаДанных.БаркодТовара);
					ЗаписьРегистра.Номенклатура = Выборка.Номенклатура;
					ЗаписьРегистра.Записать();
					КоличествоЗаписей = КоличествоЗаписей + 1;
				КонецЕсли;
			КонецЕсли;
				
		КонецЦикла;
		
		// -----------------------------------------------------------------
		// 7. Вывод сообщения
		// -----------------------------------------------------------------
		Сообщение = НСтр("ru = 'Данные из файла успешно выгружены в регистр сведений ДанныеПоКоробам.'") + Символы.ПС;
		Сообщение = Сообщение + Строка(КоличествоЗаписей) + НСтр("ru = ' записей обработано (заголовок пропущен).'");
		Сообщить(Сообщение);
		
	Исключение
		Сообщить(НСтр("ru = 'Ошибка при выгрузке данных: '") + ОписаниеОшибки());
		
	КонецПопытки;
	
	// -----------------------------------------------------------------
	// 8. Удаление временного файла
	// -----------------------------------------------------------------
	Попытка
		Если ИмяФайла <> Неопределено И Не ПустаяСтрока(ИмяФайла) Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Исключение
		// Игнорируем ошибки удаления
	КонецПопытки;
	
	// Выключаем привилегированный режим
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеПоПаллетамНаСервере(СсылкаНаФайл)
	
	Перем ЗаписьРегистра;
	Перем ТаблицаДанных;
	Перем ИмяФайла;
	Перем ДвоичныеДанныеФайла;
	
	// Включаем привилегированный режим для обхода проблем с доступом
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		// -----------------------------------------------------------------
		// 1. Проверка владельца
		// -----------------------------------------------------------------
		Владелец = Параметры.ВладелецФайла;
		Если ТипЗнч(Владелец) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ВызватьИсключение НСтр("ru = 'Функция доступна только для заказов покупателя.'");
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 2. Получаем двоичные данные файла (из хранилища 1С)
		// -----------------------------------------------------------------
		ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СсылкаНаФайл, Ложь);
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось получить данные файла.'");
		КонецЕсли;
		
		// Проверяем расширение
		ФайлОбъект = СсылкаНаФайл.ПолучитьОбъект();
		Если ФайлОбъект = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Файл не найден.'");
		КонецЕсли;
		
		Расширение = НРег(ФайлОбъект.Расширение);
		Если Расширение <> "xls" И Расширение <> "xlsx" Тогда
			ВызватьИсключение НСтр("ru = 'Неподдерживаемый формат файла. Требуется файл Excel (.xls или .xlsx).'");
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 3. Создаем временный файл на сервере (иначе ТабличныйДокумент не прочитает)
		// -----------------------------------------------------------------
		// Получаем имя временного файла с правильным расширением
		ИмяФайла = ПолучитьИмяВременногоФайла("." + Расширение);
		
		// Сохраняем двоичные данные во временный файл
		ДвоичныеДанныеФайла.Записать(ИмяФайла);
		
		// -----------------------------------------------------------------
		// 4. Читаем Excel через ТабличныйДокумент (без COM!)
		// -----------------------------------------------------------------
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		// Читаем файл. Важно: СпособЧтенияЗначений.Текст - чтобы даты и числа читались как строки
		// Это самый надежный способ, работающий на сервере без Excel
		ТабличныйДокумент.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
		// Определяем количество строк с данными
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
		
		// Создаем таблицу значений для результатов
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("ШтрихкодМоноПаллета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
		ТаблицаДанных.Колонки.Добавить("БаркодТовара", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(500)));
		ТаблицаДанных.Колонки.Добавить("ВместимостьМонопаллета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ТаблицаДанных.Колонки.Добавить("ПорядковыйНомерМонопаллета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		
		// Читаем данные, начиная со 2-й строки (пропускаем заголовок)
		Для НомерСтроки = 2 По КоличествоСтрок Цикл
			
			// Получаем значение из первой колонки
			Область1 = ТабличныйДокумент.Область(НомерСтроки, 5);
			ЗначениеКолонки1 = Область1.Текст;
			
			// Получаем значение из второй колонки
			Область2 = ТабличныйДокумент.Область(НомерСтроки, 6);
			ЗначениеКолонки2 = Область2.Текст;
			
			Область3 = ТабличныйДокумент.Область(НомерСтроки, 14);
			ЗначениеКолонки3 = Область3.Текст;
			
			Область4 = ТабличныйДокумент.Область(НомерСтроки, 16);
			ЗначениеКолонки4 = Область4.Текст;
			
			// Пропускаем пустые строки
			Если ПустаяСтрока(ЗначениеКолонки1) Тогда
				Продолжить;
			КонецЕсли;
			
			// Ограничение для производительности
			Если ТаблицаДанных.Количество() >= 10000 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаТаблицы = ТаблицаДанных.Добавить();
			СтрокаТаблицы.ШтрихкодМоноПаллета = СокрЛП(ЗначениеКолонки1);
			СтрокаТаблицы.БаркодТовара = СокрЛП(ЗначениеКолонки2);
			СтрокаТаблицы.ВместимостьМонопаллета = СокрЛП(ЗначениеКолонки3);
			СтрокаТаблицы.ПорядковыйНомерМонопаллета = СокрЛП(ЗначениеКолонки4);
			
		КонецЦикла;
		
		// Проверяем, что данные считаны
		Если ТаблицаДанных.Количество() = 0 Тогда
			Сообщить(НСтр("ru = 'В файле не найдено данных для выгрузки (после заголовка нет заполненных строк).'"));
			Возврат;
		КонецЕсли;
		
		// -----------------------------------------------------------------
		// 5. Очистка старых данных в регистре
		// -----------------------------------------------------------------
		НаборЗаписей = РегистрыСведений.ШтрихкодыМонопаллетов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Владелец);
		НаборЗаписей.Записать(Истина);
		
		// -----------------------------------------------------------------
		// 6. Запись новых данных в регистр сведений
		// -----------------------------------------------------------------
		КоличествоЗаписей = 0;
		//ТаблицаДанных.Сортировать("ШтрихкодПаллета");
		//Если ТаблицаДанных.Количество() > 1 Тогда 
		//	ПредыдущийШтрихкодПаллета = ТаблицаДанных[0].ШтрихкодПаллета;
		//КонецЕсли;
		//ПорядковыйНомерПаллета = 1;
		Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
			               |ИЗ
			               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			               |ГДЕ
			               |	СОКРЛП(ШтрихкодыНоменклатуры.Штрихкод) = &БаркодТовара
			               |	И ШтрихкодыНоменклатуры.Номенклатура.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("БаркодТовара", СокрЛП(СтрокаДанных.БаркодТовара));
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Если  Не Выборка.Следующий() Тогда 
				Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " не найден штрихкод номенклатуры, запись не будет создана!");
				Продолжить;
			Иначе
				Если Выборка.Количество() > 1 Тогда
					Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " найдено более одной записи штрихкодов (" + Выборка.Количество() +") , запись не будет создана!");
					Продолжить;
				КонецЕсли;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура
				               |ИЗ
				               |	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
				               |ГДЕ
				               |	ЗаказПокупателяЗапасы.Ссылка = &ДокументОснование
				               |	И ЗаказПокупателяЗапасы.Номенклатура = &Номенклатура";
				Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
				Запрос.УстановитьПараметр("ДокументОснование", Владелец);
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				Если  Не Выборка.Следующий() Тогда 
					Сообщить("По баркоду товара " + СокрЛП(СтрокаДанных.БаркодТовара) + " не найдена номенклатура в заказе покупателя, запись не будет создана!");
					Продолжить;
				Иначе
				
					// Вместо набора записей, для каждой строки:
					ЗаписьРегистра = РегистрыСведений.ШтрихкодыМонопаллетов.СоздатьМенеджерЗаписи();
					ЗаписьРегистра.Период = ТекущаяДата();
					ЗаписьРегистра.ДокументОснование = Владелец;
					ЗаписьРегистра.ШтрихкодМонопаллета = СокрЛП(СтрокаДанных.ШтрихкодМонопаллета);
					ЗаписьРегистра.ВместимостьМонопаллета = Число(СтрокаДанных.ВместимостьМонопаллета);
					ЗаписьРегистра.ПорядковыйНомерМонопаллета = Число(СтрокаДанных.ПорядковыйНомерМонопаллета);
					
					//Если ПредыдущийШтрихкодПаллета = СтрокаДанных.БаркодТовара Тогда
					//	ЗаписьРегистра.ПорядковыйНомерМоноПаллета = ПорядковыйНомерПаллета;
					//Иначе 
					//	ПорядковыйНомерПаллета = 1;
					//	ЗаписьРегистра.ПорядковыйНомерМоноПаллета = ПорядковыйНомерПаллета;
					//КонецЕсли;
					//ПредыдущийШтрихкодПаллета = СтрокаДанных.БаркодТовара;
					//ПорядковыйНомерПаллета = ПорядковыйНомерПаллета + 1;
					
					ЗаписьРегистра.БаркодТовара = СокрЛП(СтрокаДанных.БаркодТовара);
					ЗаписьРегистра.НоменклатураДляМонопаллета = Выборка.Номенклатура;
					ЗаписьРегистра.Записать();
					КоличествоЗаписей = КоличествоЗаписей + 1;
				КонецЕсли;
			КонецЕсли;
				
		КонецЦикла;
		
		// -----------------------------------------------------------------
		// 7. Вывод сообщения
		// -----------------------------------------------------------------
		Сообщение = НСтр("ru = 'Данные из файла успешно выгружены в регистр сведений ШтрихкодыМонопаллетов.'") + Символы.ПС;
		Сообщение = Сообщение + Строка(КоличествоЗаписей) + НСтр("ru = ' записей обработано (заголовок пропущен).'");
		Сообщить(Сообщение);
		
	Исключение
		Сообщить(НСтр("ru = 'Ошибка при выгрузке данных: '") + ОписаниеОшибки());
		
	КонецПопытки;
	
	// -----------------------------------------------------------------
	// 8. Удаление временного файла
	// -----------------------------------------------------------------
	Попытка
		Если ИмяФайла <> Неопределено И Не ПустаяСтрока(ИмяФайла) Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Исключение
		// Игнорируем ошибки удаления
	КонецПопытки;
	
	// -----------------------------------------------------------------
	// 9. Создание записей в ШтрихкодыУпаковокИТоваровДляШКПаллета
	// -----------------------------------------------------------------
	ТаблицаДанных.Свернуть("ШтрихкодМоноПаллета");
	Для Каждого СтрокаТаблицыШК Из ТаблицаДанных Цикл
		СоздатьЗаписьВШтрихкодыУпаковокИТоваровДляШКПаллета(СтрокаТаблицыШК.ШтрихкодМоноПаллета);
	КонецЦикла;
	
	// Выключаем привилегированный режим
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВШтрихкодыУпаковокИТоваровДляШКПаллета(ШКПаллета)
	
	// Пытаемся найти существующий элемент
	СуществующийЭлемент = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКПаллета);

	Если СуществующийЭлемент = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() Тогда
		// Элемент не найден — создаем новый
		НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		НовыйЭлемент.ЗначениеШтрихкода = ШКПаллета;
		НовыйЭлемент.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		НовыйЭлемент.ТипШтрихкода = Перечисления.ТипыШтрихкодов.Code128;
		НовыйЭлемент.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		НовыйЭлемент.Количество = 1;
		НовыйЭлемент.Записать();
		//Сообщить("Создан новый элемент штрихкода короба");
	Иначе
		// Элемент уже существует
		Сообщить("Элемент в ШтрихкодыУпаковокИтоваров штрихкода паллета уже существует (" + ШКПаллета + ") , повторная запись сделана не будет");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьТекущиеДанные()
	
	// ====================================================================
	// Получает текущую выбранную строку из динамического списка
	// Возвращает: Данные строки или Неопределено
	// ====================================================================
	
	Если Не СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(Элементы.Список) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Элементы.Список.ТекущиеДанные;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьКнопки()
	
	// ====================================================================
	// Обновляет доступность кнопки "Выгрузить данные по коробам"
	// Кнопка активна только при выполнении всех условий:
	// 1. Владелец - Заказ покупателя
	// 2. Выбран файл
	// 3. Файл не является группой
	// 4. Файл не зашифрован
	// 5. Файл имеет расширение .xls или .xlsx
	// ====================================================================
	
	КнопкаВыгрузить = Элементы.Найти("ВыгрузитьДанныеПоКоробам");
	Если КнопкаВыгрузить = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КнопкаВыгрузитьПаллеты = Элементы.Найти("ВыгрузитьДанныеПоМоноПаллетам");
	Если КнопкаВыгрузитьПаллеты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка 1: владелец - Заказ покупателя
	Если ТипЗнч(Параметры.ВладелецФайла) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КнопкаВыгрузить.Доступность = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	// Проверка 2: выбран файл
	ТекущиеДанные = ПолучитьТекущиеДанные();
	Если ТекущиеДанные = Неопределено Тогда
		КнопкаВыгрузить.Доступность = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	// Проверка 3: не группа
	Если ТекущиеДанные.ЭтоГруппа Тогда
		КнопкаВыгрузить.Доступность = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	// Проверка 4: не зашифрован
	Если ТекущиеДанные.Зашифрован Тогда
		КнопкаВыгрузить.Доступность = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	// Проверка 5: Excel файл
	Расширение = НРег(ТекущиеДанные.Расширение);
	Если Расширение = "xls" Или Расширение = "xlsx" Тогда
		КнопкаВыгрузить.Доступность = Истина;
		КнопкаВыгрузитьПаллеты.Доступность = Истина;
	Иначе
		КнопкаВыгрузить.Доступность = Ложь;
		КнопкаВыгрузитьПаллеты.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиВсеДублиШтрихкодовНоменклатуры()
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		               |	КОЛИЧЕСТВО(ШтрихкодыНоменклатуры.Номенклатура) КАК ЧастотаВстречаемости
		               |ИЗ
		               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыНоменклатуры.Штрихкод
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(ШтрихкодыНоменклатуры.Номенклатура) > 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КОЛИЧЕСТВО(ШтрихкодыНоменклатуры.Номенклатура) УБЫВ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
